---
kind: type
id: T:Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException
source: html/220ad785-883e-1b26-8eb0-99ffb55605fb.htm
---
# Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException

The exception that is thrown when Collaboration fails because of an external resource (e.g., Amazon S3) failure.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RevitServerCollaborationNotAvailableException : RevitServerException
```